# การแสดงผล ใช้คำสั่ง print
print("Hello PyThon : การแสดงผล ใช้คำสั่ง print")

# การคอมเม้นท์ จะใช้สัญลักษณ์ #
print("การแสดงคอมเม้นท์ : แบบบรรทัดเดียว") # การแสดงคอมเม้นแบบไว้ด้านข้าง
''' การแสดงคอมเม้นแบบใช้ ' ' ' ข้อความ ' ' '
print("การแสดงคอมเม้นท์ : แบบหลายบรรทัด 1")
print("การแสดงคอมเม้นท์ : แบบหลายบรรทัด 2")
print("การแสดงคอมเม้นท์ : แบบหลายบรรทัด 3")
'''
""" การแสดงคอมเม้นแบบใช้ " " " ข้อความ " " "
print("การแสดงคอมเม้นท์ : แบบหลายบรรทัด 1")
print("การแสดงคอมเม้นท์ : แบบหลายบรรทัด 2")
print("การแสดงคอมเม้นท์ : แบบหลายบรรทัด 3")
"""

# การใช้ฟังก์ชัน print
# string => ข้อความ ตัวอักษร จะใช้ภายใต้เครื่องหมาย ',''',""
print('การใช้ฟังก์ชัน print (string) : ด้วยเครื่องหมาย single quote')
print("การใช้ฟังก์ชัน print (string) : ด้วยเครื่องหมาย double quote")
# number => integer, float
print(3.99)
# boolean => true, false
print(True)
# ขึ้นบรรทัดใหม่ด้วย \n
print("Hello\nworld")
# การเว้นวรรคแบบ tap ด้วย \t
print("Hello\tworld")
# การเขื่อมประโยคด้วยเครื่องหมาย + ("string")
print("Hello " + "world")
# หากเป็นตัวเลข จะเป็นการบวกเลขกัน
print(5+5)

